{	
	"week8": 
	{
		"week" : "week8",
		"title" : "Clustering 4 Strangers",
		"subtitle" : "Building empathy among strangers on an app",
		"date" : "October 27, 2017",
		"image" : "http://cdn2.collective-evolution.com/assets/uploads/2015/07/Screen-Shot-2015-07-04-at-8.42.39-PM-758x500.png",
		"text" : "<h2>Meetup: Bringing Communities Back From Digital to Physical</h2> <p>Social media has penetrated every aspect of our daily lives, permanently changing the way we interact, both online and offline. At their first creation, social media companies promised more meaningful and accessible connection with others, but the reality now reflects the opposite as increasing research reports more alienation and polarization among users. For example, a study that analyzed 14,000 college students over the last 30 years showed that today’s students are 40% lower in empathy than their counterparts of 20-30 years ago, as measured by standard personality tests. Students were 40% less likely to agree with statements such as “I sometimes try to understand my friends better by imagining how things look from their perspective” (Swanbrow, 2010). Another study found that the correlation between social media use and perceived social isolation in young adults was linear (Primack et al., 2017). This increasing evidence behind antipathetic and un-social effects of social media shows us that on-screen can never replace face-to-face interactions in fulfilling our basic instinct and need for social connection.</p> <p>Building human relationships is unpredictable and challenging, but the increasing effort to replace this social element with predictable and easily removable digital interactions on Snapchat and Instagram seems ultimately futile. Physical space is defined as “a place used to comprise a physical space and the people within it” (Turkle, 2011). The permeation of social media and expansion of digital in this physical space however challenges this definition when people may be physically present but mentally absent. Can we call this a true physical space? How can software be redirected to foster, not replace, real life human interactions and help shape more meaningful physical space?</p> <p> Numerous companies and open-source software have emerged across verticals from professional networking to dating to answer this question. The inherent network effect of the problem made few far more successful than others, Meetup being the most prominent and diverse platform in the meeting exchange network platforms. The company was founded in New York City in 2002 by Scott Heiferman and Brendan McGovern, after Heiferman was inspired by how people in New York City came together to connect with strangers in the aftermath of September 11 attacks. (Jeffries, 2011) It has now grown to 32 million members, almost 290,000 groups in 182 countries with more than 3.9 million monthly RSVPs. It allows anyone to create and join interest-based, geographically defined groups, called Meetups. Meetup essentially facilitates electronic-to-face (e2f) communities, defined as groups that are created and organized online to interact physically in geographically defined ways (Weinberg and Williams, 2006). Meetup adds further dimensions to this definition by allowing people to organize based on various topics, levels of structures, and task durations (Lai, 2013). It is a new type of hybrid structural and virtual community: one that is integrated and neither exclusively offline nor exclusively online. The company’s purpose and aim, according to the <a class='intext' href='https://www.meetup.com/about/'>company website</a>, is the following: <blockquote class='blockquote'> <p class='mb-0'>“Meetup brings people together in thousands of cities to do more of what they want to do in life. It is organized around one simple idea: when we get together and do the things that matter to us, we’re at our best. And that’s what Meetup does. It brings people together to do, explore, teach and learn the things that help them come alive. For example, people run marathons, thanks to running Meetups. They write, thanks to writing Meetups. They change their careers, thanks to career Meetups. Because at Meetups, people welcome each other. They talk, help, mentor, and support each other – all in pursuit of moving their lives forward.”</p> </blockquote> </p> <p> All members can be both “organizers” and “members.” Meetup follows a subscription model, in which organizers of groups are charged monthly based on the size of the groups. The organizers then decide freely on how to cover the costs and the platform helps members raise money through local sponsors, donations, or ticket prices. By restricting the user space to only the organizers and members and leaving out third party advertisers other than local sponsors, Meetup allows proactive building of an intimate space that is directly between and for the engaged and voluntary members. This closed boundary allows Meetup groups to better mirror real human communication that social media platforms like Facebook and Instagram fail to do; unlike these platforms on which users <em>broadcast</em> information with largely vague and low-effort feedback, Meetup required high-level commitment to <em>show up and engage</em>.</p> <p> Each Meetup group serves to accomplish a specific activity/task while embedding a shared goal of connecting people in genuine physical space. The impact of any electronic-to-face communities can therefore be examined from two perspectives: its efficacy in both expanding social circles and accomplishing a specific activity/task. Meetup is not the first phenomenon of its kind; for example, members of WELL, Whole Earth ‘Lectronic Link, one of the oldest virtual communities, organized regular face-to-face gatherings since 1989 (Rheingold, 1993). Meetup, however, is unique in that it doesn’t require users to first establish online connections or to have specific interests that congregate them together in the first place. Members are loosely grouped by geographical location then shown various group options to join. This low-prerequisite and diverse-option nature of Meetup groups is appealing to users who seek to easily expand their social circles but through a targeted interest and channel. For example, using Meetup has been particularly popular among new settlers to find and establish friend groups after relocation. Evaluating the impact of attending meetups would therefore require a measure of how members have either broadended or deepened their real-life social networks.</p> <p> While Meetup’s impact on social capital is not as well understood as that of popular social media platforms, one study studies and concluded that attending Meetup groups showed stronger bonding social capital, which comes from close, frequent, and repeated connections between homogeneous people but weaker bridging social capital, which comes from episodic interactions between those of different social circles. Shen and Cage, in their study of member interactions on the Galactic Watercooler online forum and offline meetups, concluded that “people join an interest-based community to connect with like-minded others, they find the friends they seek, then strengthen these loose ties and tend to stay embedded within closed social groups” and that physical meetups function as an accelerator of this process (Shen &amp; Cage, 2015).</p> <p> It is interesting that the company recently announced a <a class='intext' href='https://www.meetup.com/about/'>policy update</a> that removes all dating and single-centric Meetup groups on its platform, thus clearly defining the scope of bonding social capital to friendships but not intimate relationships. On the company help site, it’s stated that “groups focused on dating services are not aligned with Meetup’s goal of building lasting connections among the group as a whole.” Furthermore, any single groups such as “30-something Singles of Toronto” would not be considered specific enough. This policy indicates the specific purpose that Meetup aims to serve in bridging specific enough social connections and letting them bond in groups, but not in intimate and exclusive forms.</p> <p> The other criteria for measuring Meetup’s impact is its efficacy in helping members pursue specific interests, or as Heiferman puts it, “in spawning community.” There are numerous stories on how Meetup has sparked genuine change in local communities by empowering few individuals to meet up and create opportunity. For example, <a class='intext' href='https://www.meetup.com/about/'>Code Crew Meetup</a> began in New York when two non-coders decided that they wanted to code in a study group. From a seven people group, Code Crew grew into a 11,000-person organization that hosted more than 200 learning sessions.</p> <p> One particularly successful yet controversial focus of Meetup is political activism. In 2004, Howard Dean demonstrated how he could utilize Meetup, along with other innovative online marketing vehicles like blogs, as the core campaign strategy for his Democratic Party presidential nomination campaign. In less than a year, he went from an unknown candidate to the front-runner appearing on the cover of Time magazine in August 2003 while “[empowering] hundreds of thousands of consumers/citizens to participate in the political process through community ‘meetups’” (Weinberg and Williams, 2006). The presidential meetups proved particularly effective in further engaging already active advocates of the candidate to donate, recruit, and volunteer in the campaign.</p> <p> This example of how an internet platform was used to form a proactive support group offline, even in 2004, is only a minute hallmark of how social media affects political participation today. While Meetup as a company maintained a non-partisan stance on various political activism that took place through this platform, it took a very interesting shift this year after Donald Trump’s Immigration Ban, which sparked two major protest Meetups with over 300 participants at San Francisco airport in January 2017. The company came out with an official posting to support San Francisco-based #TheResistance Meetup and to denounce the president’s policy changes. It added its own contribution to resistance by starting a “company-wide resist-a-thon” to create more than a thousand #Resist Meetup Groups. The company not only made these groups free for all, but it also sent out a public email to 30 million members and partnered with activist organizations, such as Women’s March, Human Rights Watch, Planned Parenthood, and the Anti Defamation League. The company’s <a class='intext' href='https://www.meetup.com/about/'>official Facebook post</a> about creating #Resist meetups was met with an uproar of angry comments that condemned a large profit-driven platform taking an official and clear political stance. </p> <p> The company, being a private entity, does not disclose funding and revenue information to the public but it did an approximation analysis of its economic impact beyond revenue in 2013 based on more than 2 million RSVPs and 330,000 meetups that happened every month. The analysis concluded that around 13 million USD is spent by Meetup members, with an average of about 6 USD per RSVP across all events, contributing to approximately 100-150 million USD in economic value that year. The number of RSVPs have grown double since then and perhaps the data they collect have changed, but its massive economic scale of fostering offline interactions reflects the potential of technology to create both social and economic impact in the physical space, from the users direct payment for its services without any indirect contributions from advertisers. It also implies that members are willing to invest time and money in integrating into real life communities, despite the increasing time we spend on screen. The platform has been growing rapidly and proving successful in various countries, but there is room to further steer this electronic-to-face movement in more user-friendly and approachable. Firstly, Meetup faces the tough event organization problem of receiving the expected number of attendees. The commitment rate of confirming to actual attendance might be very low because going to meet a mass group of strangers for the first time, despite sharing a specific interest, poses a tough personal challenge to overcome for many new members. Perhaps breaking down the attendees into smaller sub-groups prior to the event and motivating them to learn about each other is one way to lower this entry bar. Another problem is the ambiguous interaction requirement of attendees. Depending on the nature of the event, members may leave the event with deep understanding of and empathy with every other member, or without having made a single interaction. Providing some sort of structure in maintaining a consistent participation level for more social capital could encourage more members to engage and build social capital. Having too many options and duplicates of an interest might be another problem that prohibits than empowers users to choose a Meetup group to engage with.</p> <p> In today’s dilemma of growing social isolation despite hyperconnectivity, Meetup provides an exemplary solution of how technology can steer digital connections to thrive in physical space. We are increasingly witnessing the limited extent to which screened time spent on email or social media satisfies our basic needs for human connection and belonging. By interweaving the convenience and easy access of digital connection, the innate fulfillment from human connections, and satisfaction from pursuing personal interests, Meetup could transform virtual communities to physical communities that “help us be at our best” as the company promises. In the era of digital everything, building friendship is an inevitable and obvious market for technology to dominate. If this is inevitable, we as a collective digital users could not deny it but rather actively strive towards more novel, genuine, and empathy-provoking medium of connecting with one another, perhaps one meetup at a time. </p> <h2>References</h2> <p> Turkle, Sherry. (2011). Alone together : why we expect more from technology and less from each other. New York :Basic Books,</p> <p>Goodwin, I. (2004). Book Review: H. Rheingold. 1993. The Virtual Community: Homesteading on the Electronic Frontier. Reading, Massachusetts: Addison-Wesley. ISBN 0-201-60870-7 H. Rheingold. 2000. The Virtual Community: Homesteading on the Electronic Frontier (2nd Edition). C. Westminster Papers in Communication and Culture,1(1), 103. doi:10.16997/wpcc.206</p> <p> Jeffries, A. (2014, July 28). The Long and Curious History of Meetup.com. Retrieved October 28, 2017, from http://observer.com/2011/01/the-long-and-curious-history-of-meetupcom/</p> <p> Lai, C. (2013). Understanding the evolution of bona fide mixed-mode groups: An example of Meetup groups. First Monday,19(1). doi:10.5210/fm.v19i1.4681 Meetup (2017). About Meetup. Retrieved October 28, 2017, from https://www.meetup.com/about/</p> <p> Primack, B. A., Shensa, A., Sidani, J. E., Whaite, E. O., Lin, L. Y., Rosen, D., . . . Miller, E. (2017). Social Media Use and Perceived Social Isolation Among Young Adults in the U.S. American Journal of Preventive Medicine,53(1), 1-8. doi:10.1016/j.amepre.2017.01.010</p> <p> Shen, C., &amp; Cage, C. (2013). Exodus to the real world? Assessing the impact of offline meetups on community participation and social capital. New Media &amp; Society,17(3), 394-414. doi:10.1177/1461444813504275</p> <p> Weinberg, B. D., &amp; Williams, C. B. (2006). The 2004 US Presidential campaign: Impact of hybrid offline and online ‘meetup’ communities. Journal of Direct, Data and Digital Marketing Practice,8(1), 46-57. doi:10.1057/palgrave.dddmp.4340552</p>"
	},
	"week7": 
	{
		"week" : "week7",
		"title" : "Essay 1: Meetup",
		"subtitle" : "Bringing Communities Back From Digital to Physical",
		"date" : "October 26, 2017",
		"image" : "https://www.smartcat.io/media/2986/meetup-logo_318-64667.jpg",
		"text" : "<h2 class='post-subheading'>Social media and disconnectivity</h2> <p>It's ironic that the hyperconnectivity that social media promises causes more disconnectivity than ever. A study published in the American Journal of Preventive Medicine found that the <a class=\"intext\" href=\"http://www.ajpmonline.org/article/S0749-3797(17)30016-8/abstract\">correlation between social media use and perceived social isolation in young adults was surprisingly linear</a>. Furthermore, social media appears to not only restrict the social sphere but also the public sphere that an individual participates in. Algorithmic sorting of certain news and political views on our news feed has contributed to more polarized political views but less access to discordant opinions on social media. Despite Facebook's continuous denial of it being a news source, Facebook has undoubtedly build more distinct walls around echo chambers that users are more comfortable in.</p> <h2 class='post-subheading'>Online dating apps and offline connectivity</h2> <p>Online dating apps also play an increasingly important role in changing the nature of social interaction, but differently from social media. These apps restrict the interaction space to 2 individuals who may have romantic interest in developing an offline relationship. Creating a new channel of meeting strangers this way has been proven to introduce random links between social networks. Recent research simulated that these random links can <a class=\"intext\" href=\"https://www.technologyreview.com/s/609091/first-evidence-that-online-dating-is-changing-the-nature-of-society/\">dramatically increase interracial marriage</a>, which is an important aspect of measuring social distance in societies. </p> <h2 class='post-subheading'>Merging the two</h2> <p>So how can we apply the online dating model to create offline social interactions that bridge the exact isolation that social media created? Can online matchmaking be extended to non-romantic relationships and create genuine connections between larger social and political spheres? People belonging to traditional social clusters may share external similarities but not be the most compatible. What if we can use software to make new connections--random links--between those that look different but share similar ideas?</p> <h2 class='post-subheading'>A software solution</h2> <p>To test this idea, I want to build a system that can cluster and match people based on certain \"internal parameters\" that could make people feel connected to one another, regardless of their appearance or background. When a user inputs some interests (e.g. manual tagging, Spotify data, favorite books etc), they will be vectorized into some n-dimensional space without the stereotypes and arbitrary categories we use to categorize people. Four people with interest similarity above certain threshold will then be clustered into an online and temporary social circle. They will then be notified and encouraged to meet offline and engage in an in-depth and meaningful conversation with 3 strangers that supposedly share some interests but not all. The model would take care of much decision-making for the user, thus not inundating them with endless combinations of groups in the entire population they need to form, but rather a limited 3 choices of interesting stranger clusters that they can meet that specific week.</p> <h2 class='post-subheading'>Potential Outcome</h2> <p>By connecting them on a similar ground but also challenging them to explore their differences, this platform may be able to foster a genuine discourse and empathy. Furthermore, I want to find out of such random and non-romantic connections between strangers is sustainable and desirable, and perhaps even effective at expanding the social and political spheres that social media may have shrunk.</p>"
		},
	"week6": 
	{
		"week" : "week6",
		"title" : "mytorch.tech Sprint 2",
		"subtitle" : "Improving the mytorch.tech app based on user feedback",
		"date" : "October 20, 2017",
		"image" : "http://mytorchtech.herokuapp.com/logorec1.png",
		"text" : "<h4><a href=\"https://github.com/gaborcsapo/mytorch.tech\">code on github</a></h4> <h4><a href=\"https://mytorchtech.herokuapp.com\">mytorch.tech</a></h4> <h2>Sprint 2</h2> <p>After making the <a class='intext' href=\"https://jihjihk.herokuapp.com/projects/week4\">first prototype</a> of mytorch and presenting it to the class, we made some improvements, did more user tests, and implemented even more changes. We wanted to make the app as close to real deployment as possible by reflecting our classmates' opinions and concerns about the app.</p> <h2>User Feedback</h2> <p>We tested the app with our classmates on campus. We briefly described what the app was and let them interact with it to see what was and wasn't intuitive. It was very helpful to conduct these tests with people who we never told about mytorch because we were able to learn some crucial lessons about how to improve on the project.</p> <p>Some of the feedback:</p> <ul> <li>Lack of tagline makes the app ambiguous to first time users</li> <li>Too much text for the safety tips page</li> <li>Button texts (e.g. Public Safety) are not very clear or descriptive</li> <li>Form input validation is necessary for certain fields</li> <li>More step-by-step guide of first aid tips would be better</li> <li>Nav bar button doesn't work on mobile view</li> <li>'Settings' is not the best word; perhaps My Contacts?</li> <li>Better explanation of the consequences of pressing each button</li> <li>What happens if public safety doesn't confirm receiving of the messages?</li> <li>Who has access to the incident reports?</li> </ul> <p>Overall we learned how important it was to make the purpose of the app as clear as possible from the very first page. We were so used to working on the app that we missed how much information we omitted when editing. The same applied to other text descriptions or wordings that seemed obvious to us but were misinterpreted by first time users. So we understood that this round of improvements should not only included technical updates but also better phrasing of the text.</p> <h2>Making Improvements</h2> <p>We decided to log every user feedback we got on to the <a class='intext' href=\"https://github.com/gaborcsapo/mytorch.tech/projects/1\">Github project board</a>. This way Gabor and I could see which problems the other one worked on the past few days and get a sense of the updated features without going through the new committed changes. The key areas we worked on were: </p> <h4>MongoDB Database</h4> <p>We now have a configured MongoDB database that stores all users, users' friends contact information and incident reports. Whenever a first time user logs in to the app with their NYU credentials, a new account is created in our database, and they are prompted to input their 3 friends' contact information. This only happens at their first log in, although they can update phone numbers in /contacts page. The database also stores incident reports. It is interesting that a lot of our friends asked about who has access to these reports because often times they could be very sensitive information. Currently, it's just the admins of the heroku app that has access to the stored data, but the question of authority, access and obligation to report is something we will have to discuss and decide on.</p> <img src=\"../mytorchscreen.png\" height=\"1000px\" style=\"display: block; margin: auto\"> <p style=\"font-style: italic;\">The updated home page</p> <h4>Tagline</h4> <p>After realizing how important it was to have a clearer description of the app was, we decided to have a clear sentence \"is someone feeling unsafe?\" from the very first login page. We want this to line to convey that 1. we help someone who feels unsafe 2. you can report for yourself or for others. Right below, we also include \"Use mytorch to contact friends, RAs or Public Safety to help you or others.\" to make it clear who they can contact for help and how.</p> <h4>More Guided and Validated Form Inputs</h4> <p>We split up the form input from 1 text field for location to 4 fields for building number, residential building number, location description, and situation. By having a dropdown menu of the locations as well as helper texts, we guide the user to generate a more structured data about where they are. We also added a Situation form that asks for why the person feels unsafe. These fields are made mandatory using <a class='intext' href=\"https://validatejs.org/\">validate.js</a> validation library. We also added \"Who to Contact\" line to make it clearer that users will be contacting following people for help when they press corresponding buttons.</p> <h4>Pop-up Boxes for Confirmation</h4> <p>We added pop-up boxes in case someone pressed the wrong button or doesn't understand when to call whom. Before we had text box below buttons that explained different situations to call either public safety or RAs but we got some feedback that this wasn't as helpful so pop-up made more sense.</p> <h4>Safety Tips</h4> <p>We tried to make the safety tips and information easier to read by separating them into three divs and toggling each only when the corresponding button is clicked. We are yet to include UAE specific information but definitely want to improve on it with more pictures and region-specific information.</p> <h4>Documentation, Bugs and Other Changes</h4> <p>We also added relatively comprehensive documentation and README to open up to the community. We also want to speak to admin and relevant university offices so we thought having a well documented repository would be very helpful. We also fixed minor bugs and made other changes to improve the overall app.</p> <h2>Moving Forward</h2> <p>The more we work on this, the more there seems to do, but we are very happy with the overall progress. After having presented in the Mashups class, most of our classmates said that they would definitely use this app. We want to continue the conversation going with admin and student life office to get some funding (eg paying for API and hosting services) while opening up to the community to make improvements that we didn't think of or didn't know how to approach. For example, someone suggested that we should integrate with the Facebook messaging API to instantly message our friends on Facebook instead of trying to call them, since most of us don't have working phone numbers or know others' phone numbers. These new suggestions and advices were added to the <a class='intext' href=\"https://github.com/gaborcsapo/mytorch.tech/projects/1\">Github project board</a> so we can keep track of them and continue working on them.</p> <p>There are some questions beyond technical issues that we still need to answer. For example, the question of who gets access to the incident report data is something we need to discuss and get agreements from the NYUAD community. We might need to include a user agreement box, for example, to make sure that everyone understands who gets access to what data on this app.</p> <p>Another important decision to make is how we become liable when help is requested but it's not delivered. One way we thought of was having the Public Safety respond to the sent text message with a simple Yes or No and then we can notify the user about the status in real-time. Because Twilio doesn't provide local UAE numbers as server numbers, we have to configure a way to allow public safety, RAs or user's friends to send international texts to the number. This leads to another problem of having two incidents reported at the same time and not being able to discriminate between which incident Public Safety responded to. We thought we could include a URL that can be clicked on to confirm help being sent for a specific incident, but this doesn't account for cases in which Public Safety or RAs don't have smartphones. (In fact, the RA phone is the basic phone that only supports call and text.)</p> <p>We will hopefully meet with university offices to see what they think about our progress and how they can help us move forward. We will also try to gauge the student body's interests and get help in any way they would like to contribute in.</p>"
	},

	"week4": 
	{
		"week" : "week4",
		"title" : "mytorch.tech",
		"subtitle" : "Prototyping a safety app for campus",
		"date" : "September 27, 2017",
		"image" : "http://mytorchtech.herokuapp.com/logorec1.png",
		"text" : "<h4><a href=\"https://mytorchtech.herokuapp.com\">mytorch.tech</a></h4> <p>For this project, Gabor, Melinda and I have built a campus safety web app that makes asking for help easy. It is a Node.js based web app that is open to any NYU students to use.</p> <h2>Problem</h2> <p>Many college campuses mandate students to take basic safety protocol training to help them understand what safety standards are expected, how to navigate different hazards, and how to ask for help when needed. We also receive these trainings during the first week orientation and First Year Dialogues, but due to certain environmental circumstances, we are not allowed to explicitly receive training on substance abuse.</p> <p>This ambiguity in the admin's policies and lack of students' knowledge on how to handle these situations can hinder emergency situations from being prevented. Even when incidents happen in the presence of bystanders, they are often not prevented as early as they could be. This could be due to: </p> <ul> <li>delayed or lack of reporting due to fear of retaliation</li> <li>not knowing when to intervene (eg. how many drinks are excessive?)</li> <li>lack of first aid knowledge</li> <li>not having means to call</li> <li>not knowing how to call the RA on duty</li> <li>unclear if it is “wrong enough” to call the police, especially when intoxicated</li> <li>lack of scalable and uniform solution across campuses</li> </ul> <h2>Solution</h2> <p>To address these problems, we decided to build a web app that authenticates any NYU student to easily call public safety, residential assistants, or their friends within the website and without a phone. We wanted to differentiate between different levels of dangers and risky situations to lower the barrier of asking for help. We also enabled anonymous reporting to allow any bystander to report the incident without fearing retaliation. Having this as a web app that can easily change authentication details (eg. from NYU Abu Dhabi to Carnegie Mellon) allows it to extend across college campuses.</p> <h2>Front-end</h2> <p>The front-end uses pug as a templating engine and Bootstrap and jQuery as auxiliary libraries. The key focus was on making each button as readable and accessible as possible while differentiating between risk of situations by color and text.</p> <p>The initial landing page after login has one text field that gets the current location and passes it onto /emergency or /danger routes. This location data is received so that </p> <h2>Back-end</h2> <p>We used Express.js to create the server. Gabor was in charge of user authentication API using Google email. Using the Twillio API, we pass the location data from the GET request and use to form the text body when sending texts to Public Safety, RAs or friends.</p> <h3>Emergency</h3> <p>Emergency is categorized as a high-risk situation that requires immediate help from the public safety. After the location from /home is submitted and initial help is requested via Twillio API text, the user is re-routed to /emergency which also contains a simple incident reporting form. This form is submitted via POST request to ensure as much detail is reserved and reported at the spot.</p> <h3>Danger</h3> <p>Danger is categorized as less severe yet potentially risky situation that the user or a bystander would like to de-escalate by asking for the RAs' or friends' help. When the user submits location data and is re-routed to /danger page, the user can specify whom they would like to call and what danger they are in.</p> <h3>Tips</h3> <p>This page includes basic first aid responses for different situations. I got this information from online so they may not be specific to local laws or reporting system. Regardless most details would be useful for first aid.</p> <h3>Settings</h3> <p>This page allows a user to specify which 3 friends they would like to contact when in danger. The form asks for both email and phone number in case a friend doesn't own a local phone number but still can be contacted via email.</p> <h2>Moving Forward</h2> <p>What we have so far is a still a prototype and still has multiple limits. There are multiple assumptions made and to be tested as well.</p> <h3>Limitations and Improvements</h3> <ul> <li>anonymous reporting may result in subjective or inaccurate victims and offenders</li> <li>help not arriving on time</li> <li>technical problem failing to deliver help</li> <li>indoor navigation API</li> <li>tracking public safety's location and proximity in real time</li> <li>better mobile responsiveness</li> <li>NYUAD specific help and guidelines</li> </ul> <h3>Assumptions to test</h3> <ul> <li>anonymous reporting helps with timely reporting?</li> <li>a website is be easier to use than a phone</li> <li>it is the lack of reporting that escalates a situation</li> <li>RAs and friends can adequately address an escalated situation.</li> </ul> <h2>Conclusion</h2> <p>Overall, I am happy with the flow of the app and its potential benefits for the student body. Navigating the differences in personal beliefs and local legal system can be difficult. Rather than turning a blind eye to the situation and only emphasizing abstinence, the admin and the student body can focus on better education and realistic training to prevent serious threats and risks to this community's safety.</p>"	
	},
	"week2": 
	{
		"week" : "week2",
		"title" : "The Intervening Bystander App",
		"subtitle" : "Using software to improve campus safety",
		"date" : "September 11, 2017",
		"image" : "https://images.duckduckgo.com/iu/?u=https%3A%2F%2Fassets.entrepreneur.com%2Fcontent%2F16x9%2F822%2F20160914102048-NYUAD.jpeg&f=1",
		"text" : "<h2 class='post-subheading'>Problem</h2> <p>NYUAD is a small and tight-knit community of a little over 1,000 students. We know most of the students’ faces as interactions are inevitable at this condensed and communal campus. This lack of anonymity guarantees a certain level of safety on campus because harassment and crime committed by strangers, common at other GNU campuses in city centers, are mostly absent. Yet this small size of student body alone does not guarantee safety. The different legal standards in this country also makes it hard to handle certain offenses.</p> <h2 class='post-subheading'>Solution</h2> <p>Prevention effort, therefore, might be the most effective. <a href='http://psychology.wikia.com/wiki/Bystander_intervention']>The Bystander Intervention</a> is known as a very effective prevention strategy that involves the crowd as an intervening force before the crime actually happens. I want to build an app that allows anonymous reporting of a situation that may escalate to be harmful.</p>"
	}
}