{
	"week5": 
	{
		"week" : "week5",
		"title" : "Popular organization",
		"subtitle" : "How social media elected and impeached South Korean president",
		"date" : "October 5, 2017",
		"text" :"Social Media serves as both important means of political activism and censorship of free communication, especially in the context of public dissidents against the state on social media. This dichotomy slowly emerged from the initial rise of the world wide web that promised a free cyberspace that turned into a more central, commercial and surveiled space. \n The recent Korean candlelight protest that led to the first ever presidential impeachment embodies this dichotomy of social media well. What started as a university protest against a bribery and nepotism in the summer of 2016 was able to trigger a nationwide, 4 months long protest attended by more than 16 million people to bring down a corrupt country's president, her friend, and Samsung's president and social media was critical in many ways throughout the process. For example, it helped spread the news about the scandal amongst a generation of citizens that no longer watched TV and the public broadcasting stations that were famously state-controlled. Many citizens in their 20s and 30s relied on a smaller, private news channel named JTBC that gained a lot of trust for frequently speaking out against the government in the past despite retaliation. JTBC was also active in emphasizing its humanity and empathy in their short, shareable videos of daily news, live broadcast of trials, and interactive Q&A on social media channels to engage and inform younger generations of voters, which I believe played a huge role in the active participation of the youth in weekly candlelight protests. \n Another role social media played was organizing the weekly protests and popularizing the act of protest itself. Protesting weekly, even during the coldest weekends, was made accessible and communal by almost ubiquitous footages of friends, celebrities, politicians and even nationally popular athletes holding candles in public squares on Twitter and Facebook. The total toll of protesters exceeded 20% of the country's population without any casualty or violence during main protests, because protests were portrayed as social and peaceful gatherings--not violent uproar--that united both the public and the police against the common enemy of corrupt leaders in both the government and the Samsung empire. \n It is also interesting to note that social media, despite its active role in impeaching Park, was what elected her in the first place. The change of governments this May instantly led to trial of a number of ex-intelligence members and their prosecution for public opinion manipulation during 2012 election using social media. They admitted to posting favorable comments and re-tweets for the impeached Park when she was a running candidate in 2012 and shaming her contender Moon in numerous social media posts. While the allegations for NIS' public opinion manipulation have been open for years, the previous government's strong grasp of all executive and legislative branch didn't allow for proper investigation of the matter. \n Social media used by the state allowed Park Geun Hye to be elected in 2012 but it also quickly fired the first ever impeachment in Korea's democratic history. In \"The Networked Public Sphere and Civic Engagement In Post-2011 Egypt\" the author points out that with \"more people and players coming online, online spheres started mirroring the offline ones, rather than informing and influencing them.\" I find this to be an interesting assumption that the emergence of social media would naturally improve the organization of public discourse in physical space. The internet may have democratized the access to information and public discourse, but this alone is not enough for constructive popular organization. Rather, I believe that it is when social media can successfully create empathy among the public thus preventing polarization and opening up echo chambers that can spark exciting, decentralized and truly public decisions."
	},
	"week4": 
	{
		"week" : "week4",
		"title" : "Modeling Society",
		"subtitle" : "Computability of the real world",
		"date" : "September 25, 2017",
		"text" :"There are two video games that I have ever played of my own free will: Sims and Minecraft. Almost every weekend at the age of 14, I would stay up hours on end personalizing characters, building houses and simulating communities. After awhile the game would get repetitive and predictable, but then I would start over with a new persona, new job, new house and new \"rules to live by.\" \n Why was I so enticed into the game? The pleasure certainly ran deeper than the aesthetic pleasure of creating houses. Perhaps it was the autonomy and control. In his paper \"Dumb People, Smart Objects: The Sims and the Distributed Self\", Jeremy Tirrell explains the intricate architecture of Sims and how it \"identifies a particular model of a distributed self functioning in Sims games that dissolves distinctions between human and object, real and virtual.\" Some aspects of today's reality reflected in the Sims virtuality, such as being interpersonal, restricted in resource and time, and commodity-driven, are obvious and visceral to most players. What is not as manifest, however, is the extent to which a self (both the player's and character's) is defined by objects around it. Tirrell's claim that the distinction between real and virtual, human and object dissolve because Sims adopts and reinforces the philosophy that humans and objects are both equally important and entangled nodes in a network. \n I think Sims is both simplistic and deeply futuristic in representing the real world. The game, although very intricate and meticulous, is still programmed to a set of if else statements, lacking randomness and irrationality that are very present in real life. At the same time, the \"city blocks and transportation systems [that] function as autonomous agents according to rules based upon their physical relationship to other agents\" encapsulates the bottom-up powers of emergence that the recent rise of decentralization and blockchain come to represent. It is fascinating that although human players \"control\" the game flow, they have no means of dictating or governing the Sims reality; no player has a direct control to enforce arbitrary rules or to regulate the interpersonal interactions. This design itself puts humans as a node, rather than a controller, of the decentralized web. \n Can such co-dependent autonomy in which central institutions are just another nodes and not commanding bodies exist in the real world? If inanimate objects without character or irrational decision making dictated humans' behaviors, can we exist without unrest? According to the \"Modeling civil violence: an agent-based computation approach\" paper, two ethnic groups can peacefully co-exist with high legitimacy. If every node perceived each other's right to exist as equal, then cops or legal system are not required to keep peace. If this computational model was realistic enough thus accurate, how can we experiment with a society in which every node is equally legitimate? \n While Tirrell's observation of the reality as a decentralized network between humans and objects is fascinating, I do not see self as something determined by objects. While materialistic ownership is still very dominant, don't we as humans recognize experiences more than physical objects to have shaped our views? Also similar \"local nodes\" share many objects from same computers to public buses, but these alone cannot account for the varying degrees of personality amongst us. \n If I were to play Sims again, would I be as obsessed as I was seven years ago? Probably not. It might be due to the greater autonomy and legitimacy I believe I have in my life. Or could it possibly be the greater freedom I feel from the need to own and abide by the material objects around me?"
	},
	"week3": 
	{
		"week" : "week3",
		"title" : "The Black Box Bias",
		"subtitle" : "Letting the data decide for us",
		"date" : "September 18, 2017",
		"text" : "Machine learning is literally leaving the decision-making process to an algorithm and asking for only the results of a certain computation. This abstraction tool is becoming more accessible as it becomes even more abstracted from the machine into simple libraries like sci-kit learn, with which we can now focus more applying than devising the algorithm. \n One useful application of machine learning is Spotify's Discover Weekly, which trains on individual's weekly music taste and then gives recommendations. The decision-making is relatively simple in this case; we can safely assume that the frequency of listening to a song is highly correlated with our liking for the music, although one week of abnormal listening behavior is likely to very easily throw off the recommendations. It's a relatively simple black box that does what we expect it to that trains on very relevant dataset--individual's playlist. \n Can the same black box be used to identify terrorists to kill? Other machine learning models, however, are hard to predict and ever so data hungry that the priority is often on getting a lot of data regardless of relevance. In the case of calculating a dispersion matrix based on phone signals, contact frequency, geolocation, and other unannotated data, identifying hot nodes thus nominating terrorists to kill is not as simple as predicting someone's music taste. As stated in Weber's paper, it is not easy to foresee terrorist attack based on certain behavior, yet the model assumes certain metrics such as frequency of contact in a social network as a significant indicator of terrorist activity. \n There are numerous levels of abstraction in president's Terror Tuesday decision-making process: first from the unannotated mass data to the machine learning algorithms to software engineers to intelligence agency, then to final decision-making. Isn't it inevitable that a lot of false positives and false negatives will arise along this long and unclear abstraction pipeline? Aren't the consequences of these false signals a matter of life and death? But really, do they care?"
	},
	"week2": 
	{
		"week" : "week2",
		"title" : "Private Persons / Public Space",
		"subtitle" : "Software for and against the public",
		"date" : "September 11, 2017",
		"text" : "Software has fundamentally changed the way both private and public opinions are voiced. Software is not a singular, isolated technology living inside hardware but rather a microcosm of its own, thus inherently ambivalent. The role it has played in voicing individual opinions in the public opinion is especially double-sided.\nThe definition of public sphere has changed with every turn in history. As explained in “The Public Sphere: An Encyclopedia Article (1964)” the scope of what public sphere includes has slowly expanded with history. From the feudal times during which the authorities “represent their power before the people, instead of for the people”, the public sphere expanded to include the actual public opinion thanks to the rise of literary journalism. Software has further augmented what journalism achieved in intensifying public discussion. How Twitter gives individuals an equal platform to be heard, sometimes by public officials, is one example of social media as software’s use case is expanding the scope of public sphere. It is not just the end result of using software, but the “actively working with the data: reorganizing it, uncovering the connections, becoming aware of correlations” (Chun, 2004) that software truly becomes a tool of empowerment. I think that one can even argue that writing code is a creative outlet for individuals to communicate.\nSoftware, however, is also as effective in silencing voices as it is in amplifying them, depending on who is behind building the software. This paradox is like the illusion of transparency that humans see at the cost of hiding the machines. For example, surveillance programs like the Matrix and analytics tools running in between requests and responses is how centralized authorities attempt to influence and breach the public opinion using software. Another example is the polarization of software engineers demographic, especially in gender. Despite many of the first generation programmers being female and machines lacking gender values, software engineering is becoming dominantly male-dominated, just within a few decades of its invention.\nWhile other industries may also have unbalanced representation, I think an equal representation in race, gender, and other background is especially important in software engineering. Software is referred to as the “actant in the world” that “augments, supplements, mediates, and regulates our live sand opens up new possibilities—but not in a deterministic way” (Kitchen & Dodge, 2011). Software is no longer a product but also a producer in that it disciplines our interactions with and expectations from software. As discussed before, software has a tremendous power of amplifying individual voices. If this gender imbalance persists and software becomes self-fulfilling prophecy that empowers only the voices of its creators-alike, it could become a dangerous loop of restricting the public sphere to only the powerful few, like the past societies."
	}
}